In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv("scooters.csv",names=["scooter_name","price"],skiprows=[0])
df

     scooter_name    price
0          activa    90000
1         jupyter    85000
2    ola electric   150000
3  ather electric   160000
4   suzuki access    80000
5            AUDI  8000000

In [3]:
df.describe()

              price
count  6.000000e+00
mean   1.427500e+06
std    3.220040e+06
min    8.000000e+04
25%    8.625000e+04
50%    1.200000e+05
75%    1.575000e+05
max    8.000000e+06

In [9]:
df.price.quantile(0) #percentile value

np.float64(80000.0)

In [10]:
df.price.quantile(0.25)

np.float64(86250.0)

In [11]:
df.price.quantile(0.75)

np.float64(157500.0)

In [12]:
df.price.quantile(0.50)

np.float64(120000.0)

In [14]:
df.price.quantile(0.25,interpolation="midpoint")

np.float64(87500.0)

In [10]:
percentile_99=df.price.quantile(0.99)
percentile_99 # 76 lakhs 8 thousand

np.float64(7608000.000000002)

In [11]:
# get the outlier value (it is a car)
df[df.price>percentile_99]

  scooter_name    price
5         AUDI  8000000

In [12]:
# removing outilers
df[df.price<percentile_99]

     scooter_name   price
0          activa   90000
1         jupyter   85000
2    ola electric  150000
3  ather electric  160000
4   suzuki access   80000

In [17]:
df.loc[2,'price']=np.nan
df

     scooter_name      price
0          activa    90000.0
1         jupyter    85000.0
2    ola electric        NaN
3  ather electric   160000.0
4   suzuki access    80000.0
5            AUDI  8000000.0

In [17]:
# again , mean does not works well 
df.fillna(df.price.mean())

     scooter_name      price
0          activa    90000.0
1         jupyter    85000.0
2    ola electric  1683000.0
3  ather electric   160000.0
4   suzuki access    80000.0
5            AUDI  8000000.0

In [19]:
new_df=df.fillna(df.price.median())
new_df

     scooter_name      price
0          activa    90000.0
1         jupyter    85000.0
2    ola electric    90000.0
3  ather electric   160000.0
4   suzuki access    80000.0
5            AUDI  8000000.0

In [23]:
# get all the scooters between 50000 and 1 lakhs 
df[(df.price>=50000) & (df.price<=100000)]

    scooter_name    price
0         activa  90000.0
1        jupyter  85000.0
4  suzuki access  80000.0